f32c/arduino/hardware/fpga/f32c/tools/boards-manager/boards.txt
#
# Altera TB276 Board (ebay), f32c SoC
#
fpga_tb276.name=TB276 (Altera Cyclone IV E EP4CE6, 16K BRAM, 81.25/112.5 MHz)
fpga_tb276.build.mcu=f32c
fpga_tb276.build.core=f32c
fpga_tb276.upload.tool=ujprog
fpga_tb276.upload.wait_for_upload_port=false
fpga_tb276.upload.native_usb=false
fpga_tb276.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/tb276.cfg
fpga_tb276.bootloader.file_svf=tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.svf
fpga_tb276.bootloader.file_jic=tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.jic
fpga_tb276.bootloader.file_sof=tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.sof
fpga_tb276.menu.cpu.mips=MIPS
fpga_tb276.menu.cpu.mips.cpu.arch=mips
fpga_tb276.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_tb276.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_tb276.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_tb276.menu.cpu.riscv=RISC-V
fpga_tb276.menu.cpu.riscv.cpu.arch=riscv
fpga_tb276.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_tb276.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_tb276.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_tb276.menu.ramsize.16=16 KB BRAM Internal
fpga_tb276.menu.ramsize.16.upload.maximum_size=14848
fpga_tb276.menu.ramsize.16.build.extra_flags=--section-start=.init=0x400
fpga_tb276.menu.speed.81=81.25 MHz
fpga_tb276.menu.speed.81.build.fcpu=81250000
fpga_tb276.menu.speed.81.bitstream.fcpu.mhz=81
fpga_tb276.menu.speed.112=112.5 MHz
fpga_tb276.menu.speed.112.build.fcpu=112500000
fpga_tb276.menu.speed.112.bitstream.fcpu.mhz=112
fpga_tb276.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_tb276.menu.protocol.hex.upload.protocol=hex
fpga_tb276.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_tb276.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_tb276.menu.protocol.bin.upload.protocol=bin
fpga_tb276.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_tb276.menu.pinmap.generic=Generic
fpga_tb276.menu.pinmap.generic.build.variant=generic
fpga_tb276.menu.jtag.alterablaster=Altera Blaster
fpga_tb276.menu.jtag.alterablaster.bootloader.openocd.interface=interface/altera-usb-blaster.cfg
fpga_tb276.menu.jtag.remotebitbang=Remote bitbang (TCP)
fpga_tb276.menu.jtag.remotebitbang.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/remote_bitbang.cfg
fpga_tb276.menu.jtag.fpu1=FT2232 PLDkit FPU1
fpga_tb276.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
fpga_tb276.menu.bitstream.sram=SRAM openocd (temporary)
fpga_tb276.menu.bitstream.sram.upload.bitstream.command="openocd" "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command=svf -tap chip.tap {runtime.platform.path}/bootloaders/{bootloader.file_svf}" "--command=shutdown"
fpga_tb276.menu.bitstream.sramquartus=SRAM quartus (temporary)
fpga_tb276.menu.bitstream.sramquartus.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "P;{runtime.platform.path}/bootloaders/{bootloader.file_sof}"
fpga_tb276.menu.bitstream.flashquartus=FLASH quartus (permanent)
fpga_tb276.menu.bitstream.flashquartus.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "IPV;{runtime.platform.path}/bootloaders/{bootloader.file_jic}"

#
# FPGArduino Generic f32c SoC
#
fpga_generic.name=Generic FPGA board
fpga_generic.build.mcu=f32c
fpga_generic.build.core=f32c
fpga_generic.upload.tool=ujprog
fpga_generic.upload.wait_for_upload_port=false
fpga_generic.upload.native_usb=false
fpga_generic.menu.cpu.mips=MIPS
fpga_generic.menu.cpu.mips.cpu.arch=mips
fpga_generic.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_generic.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_generic.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_generic.menu.cpu.riscv=RISC-V
fpga_generic.menu.cpu.riscv.cpu.arch=riscv
fpga_generic.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_generic.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_generic.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_generic.menu.ramsize.8=8 KB BRAM Internal
fpga_generic.menu.ramsize.8.upload.maximum_size=6656
fpga_generic.menu.ramsize.8.build.extra_flags=--section-start=.init=0x400
fpga_generic.menu.ramsize.16=16 KB BRAM Internal
fpga_generic.menu.ramsize.16.upload.maximum_size=14848
fpga_generic.menu.ramsize.16.build.extra_flags=--section-start=.init=0x400
fpga_generic.menu.ramsize.32=32 KB BRAM Internal
fpga_generic.menu.ramsize.32.upload.maximum_size=31232
fpga_generic.menu.ramsize.32.build.extra_flags=--section-start=.init=0x400
fpga_generic.menu.ramsize.64=64 KB BRAM Internal
fpga_generic.menu.ramsize.64.upload.maximum_size=64000
fpga_generic.menu.ramsize.64.build.extra_flags=--section-start=.init=0x400
fpga_generic.menu.ramsize.128=128 KB BRAM Internal
fpga_generic.menu.ramsize.128.upload.maximum_size=129536
fpga_generic.menu.ramsize.128.build.extra_flags=--section-start=.init=0x400
fpga_generic.menu.ramsize.1024=1 MB SRAM Onboard
fpga_generic.menu.ramsize.1024.upload.maximum_size=1015808
fpga_generic.menu.ramsize.1024.build.extra_flags=--section-start=.init=0x80000000
fpga_generic.menu.speed.10=10 MHz
fpga_generic.menu.speed.10.build.fcpu=10000000
fpga_generic.menu.speed.20=20 MHz
fpga_generic.menu.speed.20.build.fcpu=20000000
fpga_generic.menu.speed.25=25 MHz
fpga_generic.menu.speed.25.build.fcpu=25000000
fpga_generic.menu.speed.30=30 MHz
fpga_generic.menu.speed.30.build.fcpu=30000000
fpga_generic.menu.speed.33=33.3 MHz
fpga_generic.menu.speed.33.build.fcpu=33333333
fpga_generic.menu.speed.40=40 MHz
fpga_generic.menu.speed.40.build.fcpu=40000000
fpga_generic.menu.speed.50=50 MHz
fpga_generic.menu.speed.50.build.fcpu=50000000
fpga_generic.menu.speed.60=60 MHz
fpga_generic.menu.speed.60.build.fcpu=60000000
fpga_generic.menu.speed.66=66.6 MHz
fpga_generic.menu.speed.66.build.fcpu=66666666
fpga_generic.menu.speed.70=70 MHz
fpga_generic.menu.speed.70.build.fcpu=70000000
fpga_generic.menu.speed.75=75 MHz
fpga_generic.menu.speed.75.build.fcpu=75000000
fpga_generic.menu.speed.80=80 MHz
fpga_generic.menu.speed.80.build.fcpu=80000000
fpga_generic.menu.speed.81=81.25 MHz
fpga_generic.menu.speed.81.build.fcpu=81250000
fpga_generic.menu.speed.90=90 MHz
fpga_generic.menu.speed.90.build.fcpu=90000000
fpga_generic.menu.speed.100=100 MHz
fpga_generic.menu.speed.100.build.fcpu=100000000
fpga_generic.menu.speed.112=112.5 MHz
fpga_generic.menu.speed.112.build.fcpu=112500000
fpga_generic.menu.speed.125=125 MHz
fpga_generic.menu.speed.125.build.fcpu=125000000
fpga_generic.menu.speed.133=133.3 MHz
fpga_generic.menu.speed.133.build.fcpu=133333333
fpga_generic.menu.speed.150=150 MHz
fpga_generic.menu.speed.150.build.fcpu=150000000
fpga_generic.menu.speed.166=166.6 MHz
fpga_generic.menu.speed.166.build.fcpu=166666666
fpga_generic.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_generic.menu.protocol.hex.upload.protocol=hex
fpga_generic.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_generic.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_generic.menu.protocol.bin.upload.protocol=bin
fpga_generic.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_generic.menu.protocol.binftdi=Binary 3 Mbit/s CRC FTDI
fpga_generic.menu.protocol.binftdi.upload.protocol=bin
fpga_generic.menu.protocol.binftdi.upload.flags=-re
fpga_generic.menu.pinmap.generic=Generic
fpga_generic.menu.pinmap.generic.build.variant=generic
fpga_generic.menu.pinmap.ulx2s_physical=ULX2S Physical
fpga_generic.menu.pinmap.ulx2s_physical.build.variant=ulx2s_physical
